---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CircuitConnectionType
source: html/51ed3bd4-ffc7-b727-5e54-5dbee8fb3e11.htm
---
# Autodesk.Revit.DB.Electrical.CircuitConnectionType

An enumerated type indicates the panel to panel connection type

## Syntax (C#)
```csharp
public enum CircuitConnectionType
```